import React, { useState } from "react";

const Lab1 = () => {
  const [maxDots, setmaxDots] = useState("");
  const [result, setResult] = useState("");

  const Calculate = () => {

    let diamontsAmount = parseInt(0);
    for (let i = parseInt(maxDots); i >= 0; i--) {
        for (let j = parseInt(i); j >= 0; j--) {
            diamontsAmount += i + j;
        }
    }
    setResult(diamontsAmount);
  };


  return (
    <div style={{ marginLeft: "15px" }}>
      <h1>Лабораторна робота №1</h1>
      
      <h2>Умова задачі:</h2>
      <p>
      Щоб заробити величезний капітал, новим російським необхідно мати неординарне мислення. Звичайно, при такій складній роботі повинні 
      бути присутніми якісь особливі механізми для відпочинку та розваг. З цією метою в казино придумали спеціальний набір доміно для нових 
      росіян. Звичайні кістки доміно є набір з різних комбінацій поєднань двох плиток, на кожній з яких відображається від 0 до 6 точок. 
      А цей набір є подібними поєднаннями плиток, але кількість точок на кожній може бути від нуля до заданого значення, яке залежить від 
      інтелектуального рівня гравців. У такому наборі кісток присутні різні поєднання плиток, але при цьому жодна з кісток не повторюється 
      (навіть такі комбінації як 2-5 і 5-2 вважаються однаковими). Для виготовлення даного набору кісток перед виробником постала 
      проблема обчислення сумарної кількості точок на всіх кістках доміно. Це пов'язано з тим, що доміно для нових росіян прикрашається діамантами,
       які є крапками на плитках і при виготовленні необхідно оцінити вартість. Допоможіть написати програму, яка вирішить це завдання.
      </p>
      <h2>Вхідні дані:</h2>
      <p>
      Рядок містить одне натуральне число N – максимальна кількість точок на одній плитці доміно. (N ≤ 10000)
      </p>
      <h2>Вихідні дані:</h2>
      <p>
      Виведіть кількість діамантового каміння, яке необхідно виготовити для заданого набору кісток.
      </p>
      <h2>Приклад</h2>
      <p>
        <b>INPUT:</b>
      </p>
      <p> 2</p>
      <p>
        <b>OUTPUT:</b>
      </p>{" "}
      <p>12</p>
      <label>
       Кількість крапок:
        <input
          type="text"
          value={maxDots}
          onChange={(e) => setmaxDots(e.target.value)}
        />
      </label>
      <br />
      <br />
      <button onClick={Calculate}>Обчислити</button>
      <br />
      <div>Результат: {result}</div>
    </div>
  );
};

export default Lab1;